[{"post":" …channel of acquisition in the WordPress Plugin directory. I've personally spent a few days to understand how to optimize the Customerly Live Chat plugin to rank on the top positions for certain keywords. This is the results: 2 position for a popular keyword like \"free live chat\" and top 10 for \"live chat\". When we launched this on WordPress we were on the 33rd position with the same keyword.  3 days later we were 5th. Now we are 2nd.  Our active installs are definitely lower than our competitors but still, we are there.  This brought to our platform 15K+ users to signup. Cost per acquisition? Zero. Time to execute: one week. You need to be clever when you #bootstrap. Find out alternative channels where your customers are and find a way to help them where they are. This is the full article: [https://www.customerly.io/blog/live-chat/2020/07/09/how-we-have-got-13k-b2b-signups-for-free-by-using-wordpress-directory-with-live-chat-plugin](https://www.customerly.io/blog/live-chat/2020/07/09/how-we-have-got-13k-b2b-signups-for-free-by-using-wordpress-directory-with-live-chat-plugin) #saas #growthmarketing #growthhacking #marketing #business #startup107 10740 ","link":"https://www.facebook.com/groups/SaaSgrowthhacking/posts/3009361695785663/"},{"post":" …So, we're considering moving away from WordPress to the custom website with some other external CMS. I have two questions. 1 - Will this change affect your SEO? Considering that we are not changing anything in the sitemap so we're keeping all the exact URLs, meta information, blog content, etc. The only thing that's going to change is the actual CMS and the tech stack of the website. 2 - Which CMS-s would you recommend and why?5 548 ","link":"https://www.facebook.com/groups/SaaSgrowthhacking/posts/4087590531296102/"},{"post":" Best Free or Paid WordPress Blog theme for a Saas? I understand \"Best\" is subjective. We are looking for a themes which are responsive and makes it easy for readers to read, ability to embed videos, aids in SEO, social distribution etc., You can tell I am a WP newbie. We ran into issues with self-hosted ghost when we deployed two ghost instances on two EC2 instances with ELB  and one DB (RDS) . It started throwing 404 and 500 errors. Couldn't figure how to resolve it, so transitioning to WP. Thank you in advance for your kind recommendations.3 ","link":"https://www.facebook.com/groups/SaaSgrowthhacking/posts/1776675005721011/"},{"post":" Does anyone use WordPress for the landing page of your SAAS? What are the pros and cons? How do you design the blog section ?  Thanks in advance2 28 ","link":"https://www.facebook.com/groups/SaaSgrowthhacking/posts/2090851177636724/"},{"post":" …anybody who can design our Wordpress blog nicely, please recommend it. Thanks :)2 26 ","link":"https://www.facebook.com/groups/SaaSgrowthhacking/posts/1400904146631434/"},{"post":" …blog for my SaaS.  What is the best practice for this? Should I just create a wordpress blog? Subdomain vs subdirectory? What would you recommend given I am starting fresh?3 328 ","link":"https://www.facebook.com/groups/SaaSgrowthhacking/posts/2787353974653104/"},{"post":" …our blog URL from blog.examplesite.com to examplesite.com/blog? Our blog gets decent traffic and is hosted on Wordpress, but our SaaS app is hosted on Heroku and we need to change the URl path.  Thought or ideas?3 310 ","link":"https://www.facebook.com/groups/SaaSgrowthhacking/posts/2233781060010401/"},{"post":" …a Wordpress plugin (Polylang or WPML) 2) Creating a second Wordpress instance Who has done it before and what option would you recommend? Thanks in advance :)4 411 ","link":"https://www.facebook.com/groups/SaaSgrowthhacking/posts/1985106288211214/"},{"post":" …....and my sendgrid smtp on my wordpress blog, and my email auto responder. I’m confused regarding the logistics... like is the auto responder using my gsuite smtp or their own? Do I add the spf and dkim to my domain for my gsuite or sendgrid or both? I’m confused lol.2 23 ","link":"https://www.facebook.com/groups/SaaSgrowthhacking/posts/2958654194189747/"},{"post":"","link":"https://www.facebook.com/groups/SaaSgrowthhacking/posts/2937993079589192/"},{"post":" …option to implement blogs or better to implement custom blog to manage manual everything.  If you think, Wordpress, then would you like to recommend me some good theme  which i can use for blog.  Thanks..4 438 ","link":"https://www.facebook.com/groups/SaaSgrowthhacking/posts/2572780736110430/"},{"post":"","link":"https://www.facebook.com/groups/SaaSgrowthhacking/posts/4129548767100278/"},{"post":" …some advice. Taking our blog off of Medium. Wordpress or Ghost.org, and why?  :)ghost.orgGhost: Turn your audience into a business6 622 ","link":"https://www.facebook.com/groups/SaaSgrowthhacking/posts/2222952671093240/"},{"post":" What blog CMS other than wordpress are you using for your site's blog? Easier to match the design with main site.1 19 ","link":"https://www.facebook.com/groups/SaaSgrowthhacking/posts/1967676219954221/"},{"post":"  Hey, I have question for B2B SaaS folks! Would you run your marketing website on WordPress? (the software, not the WP hosting)\nWe're talking proper setup on WP hosting like Flywheel, Pantheon, etc., (using Nginx, Varnish cache, etc.) + visual builder (Divi, Elementor, etc).\nAre you one of the SaaS companies that do that? any problems so far?\nOr are you on of the companies strongly suggesting not to? why?\nOne of the ideas for this question is to have unified setup of web + blog and to have the blog in subdirectory, not subdomain.\nWhat is your setup?1 114 ","link":"https://www.facebook.com/groups/SaaSgrowthhacking/posts/2138818932839948/"},{"post":" …of any good Wordpress design people? Who create a wordpress theme based on my homepage and seemlesy integrate my blog? *at a reasonable price, don’t need anything fancy1 115 ","link":"https://www.facebook.com/groups/SaaSgrowthhacking/posts/2119368344785007/"},{"post":" …disadvantages of hosting your company's blog on Hubspot instead (for example) on Wordpress?1 18 ","link":"https://www.facebook.com/groups/SaaSgrowthhacking/posts/2409819482406557/"},{"post":" **Best Practice for Wordpress Integration** I have my production app running on Heroku and DNSimple for DNS.   Wondering how to go about installing Wordpress on a subdomain, say blog.mydomain.com, for example. Recommend any hosts for this?  Any helpful instructions?  I'm not clear on how this works.5 ","link":"https://www.facebook.com/groups/SaaSgrowthhacking/posts/2362848407103665/"},{"post":" Hi Everyone, Looking for Wordpress hosting recommendations for a basic website with a basic blog.  Customer service is important, decent pricing, and some type of simple cpanel to use. Any trusted WP hosts?24 ","link":"https://www.facebook.com/groups/SaaSgrowthhacking/posts/2856678967720604/"},{"post":" …First step is choosing the right Wordpress theme / framework, which will live on a subdomain (eg. blog.oursite.com) I have a couple in mind, but wanted to see if there's any favourites here on SGH. What do you use?26 ","link":"https://www.facebook.com/groups/SaaSgrowthhacking/posts/1599536093434904/"}]